tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "bat"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
cask "1password"
cask "aerospace"
cask "alacritty"
cask "firefox-developer-edition"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "google-chrome"
cask "notion"
cask "raycast"
cask "sf-symbols"
