tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "xykong/tap"

# Languages/Runtimes & Package managers
brew "bash"
brew "zsh"
brew "oven-sh/bun/bun"
brew "deno"
brew "nvm"
brew "go"
brew "uv"
brew "ruby"

# CLI utils
brew "bat"
brew "curl"
brew "git"
brew "ripgrep"
brew "jq"
brew "eza"
brew "fd"
brew "fzf"
brew "watch"

# CLI tools
brew "awscli"
brew "cloudflare-wrangler"
brew "gcc"
brew "gnu-time"
brew "stow"
brew "tree-sitter"
brew "tectonic"
brew "diff-so-fancy"
brew "tree-sitter-cli"

# CLI apps
brew "lazygit"
brew "neovim"
brew "starship"
brew "tmux"
brew "sst/tap/opencode"
cask "claude-code"

# Mac helpers
brew "cocoapods"
brew "mkcert"
brew "cairo"
cask "font-computer-modern"
cask "font-jetbrains-mono-nerd-font"
cask "nikitabobko/tap/aerospace"
cask "xykong/tap/flux-markdown"
cask "betterdisplay"


# Produtivity Apps
cask "notion"
cask "obsidian"
cask "raycast"
cask "screen-studio"
cask "zoom"
cask "zen"
cask "alacritty"

# Microsoft sigh
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"

# Browsers
cask "brave-browser"
cask "google-chrome"
cask "helium-browser"

# Dev apps
cask "docker-desktop"
cask "bruno"

# Miscellaneous
brew "glib"
cask "legcord"
cask "minecraft"
cask "mp3tag"
cask "steam"

cargo "leetcode-cli"
cargo "wasm-pack"
