tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "bat"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "jq"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "zsh"
cask "1password"
cask "aerospace"
cask "alacritty"
cask "arc"
cask "brave-browser"
cask "docker"
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "postman"
cask "raycast"
cask "visual-studio-code"
cask "zoom"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
